chapter-3-14/app/views/shared/_user_info.html.haml

%span= link_to "view my profile", current_user
%span= pluralize(current_user.microposts.count, "micropost")
---
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 4]]