chapter-3-14/app/views/users/show.html.haml

    = render 'follow_form' if logged_in?
    - if @user.microposts.any?
      %h3
        Microposts (#{@user.microposts.count})
---
SELECT 1 AS one FROM "microposts" WHERE "microposts"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 1]]