chapter-3-14/app/views/users/show_follow.html.haml

        %b Microposts:
        = @user.microposts.count
---
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 4]]