chapter-3-4/app/views/users/show.html.haml

SELECT 1 AS one FROM "microposts" WHERE "microposts"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 1]]
---
  .col-md-8
  - if @user.microposts.any?
    %h3
      Microposts (#{@user.microposts.count})